cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
void reconnectMQTT() {
  Serial.printf("[MQTT] Melakukan koneksi ke broker EMQX %s:%d...\n", mqtt_server.c_str(), mqtt_port);
  
  // TCP Ping Cepat (Timeout maksimal 1 detik)
  // Mencegah fungsi koneksi mem-blokir program selama 15 detik jika IP/Server sedang mati
  if (!espClient.connect(mqtt_server.c_str(), mqtt_port, 1000)) {
    Serial.println("[MQTT] ERROR: Broker tidak merespon / IP tidak dapat dijangkau.");
    return; // Langsung keluar agar sistem & WDT tetap berjalan normal
  }
  espClient.stop(); // Port terbuka! Tutup ping socket agar mqttClient aslinya bisa terkoneksi

  espClient.setTimeout(1200); 

  // Beri makan WDT sebelum proses koneksi yang memakan waktu (blocking)
  esp_task_wdt_reset();

  bool connected = false;
  if (mqtt_user.length() > 0) {
    connected = mqttClient.connect(mqtt_client_id.c_str(), mqtt_user.c_str(), mqtt_pass.c_str());
  } else {
    connected = mqttClient.connect(mqtt_client_id.c_str());
  }

  // Beri makan WDT setelah selesai proses koneksi
  esp_task_wdt_reset();

  if (connected) {
    Serial.println("[MQTT] Terhubung!");
    
    String resTopic = "gate/" + mqtt_client_id + "/result";
    String cmdTopic = "gate/" + mqtt_client_id + "/command";
    
    mqttClient.subscribe(resTopic.c_str());
    mqttClient.subscribe(cmdTopic.c_str());
    
    Serial.println("[MQTT] Berhasil subscribe ke topik result & command.");
  } else {
    Serial.print("[MQTT] Gagal terhubung ke broker, rc=");
    Serial.println(mqttClient.state());
  }
}

// ========================================================================
// 8. SETUP & LOOP
// ========================================================================
void setup() {
  Serial.begin(115200);
  delay(1000);

  // Ambil data konfigurasi dari memori internal (NVS)
  preferences.begin("gate_config", true);
  folderAktif    = preferences.getString("ota_folder", "ESP32main");
  savedApSSID    = preferences.getString("ap_ssid", DEFAULT_AP_SSID);
  mqtt_server    = preferences.getString("mqtt_server", mqtt_server);
  mqtt_port      = preferences.getInt("mqtt_port", mqtt_port);
  mqtt_user      = preferences.getString("mqtt_user", mqtt_user);
  mqtt_pass      = preferences.getString("mqtt_pass", mqtt_pass);
  mqtt_client_id = preferences.getString("mqtt_client_id", mqtt_client_id);
  rfid_master    = preferences.getString("rfid_master", rfid_master);
  preferences.end();

  // Konfigurasi WiFiManager
  wm.setConnectTimeout(15); // Coba koneksi ke router 15 detik
  if (wm.getWiFiIsSaved()) {
    // Jika sudah ada WiFi tersimpan, coba konek tanpa buka Hotspot otomatis jika router mati
    wm.setEnableConfigPortal(false); 
  }
  
  Serial.println("\n[WIFI] Mencoba terhubung ke jaringan...");
  if (!wm.autoConnect(savedApSSID.c_str(), DEFAULT_AP_PASSWORD)) {
    Serial.println("[WIFI] Gagal terhubung atau masuk mode setup Hotspot.");
  } else {
    Serial.println("[WIFI] Sukses Terhubung! IP Web Dashboard: " + WiFi.localIP().toString());
  }

  // Routing Halaman Web
  server.on("/", handleRoot);
  server.on("/status_data", HTTP_GET, handleStatusData);
  server.on("/reconnect_wifi", HTTP_GET, handleReconnectWifi);
  server.on("/forget_wifi", HTTP_GET, handleForgetWifi);
  server.on("/save_folder", HTTP_POST, handleSaveFolder);
  server.on("/save_mqtt", HTTP_POST, handleSaveMqtt);
  server.on("/save_master", HTTP_POST, handleSaveMaster);
  server.on("/trigger_relay", HTTP_GET, handleTriggerRelay);
  server.on("/reboot", HTTP_GET, handleReboot);
  server.on("/cek_update", HTTP_GET, handleCekUpdate);
  server.on("/do_update", HTTP_GET, handleDoUpdate);
  
  // Handler Upload Manual
  server.on("/update", HTTP_POST, handleManualUpdate, handleManualUpload);

  server.begin();

  // Inisialisasi SPI & RFID MFRC522 (VSPI default)
  SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI, SS_PIN); 
  mfrc522.PCD_Init();
  mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);

  // Cek versi sensor saat awal boot
  byte v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
  Serial.printf("[RFID] Version Register: 0x%02X\n", v);
  if (v == 0x91 || v == 0x92 || v == 0x88 || v == 0x82 || v == 0x12) {
    rfidStatus = "✅ AKTIF";
    Serial.println("[RFID] Sensor MFRC522 terdeteksi dan siap.");
  } else {
    rfidStatus = "❌ TIDAK MERESPON (Cek Pin/Kabel)";
    Serial.println("[RFID] PERHATIAN: Sensor MFRC522 tidak terdeteksi!");
  }

  // Setup Barcode Scanner (UART2)
  Serial2.begin(BARCODE_BAUD, SERIAL_8N1, BARCODE_RX, BARCODE_TX);
  Serial.println("[BARCODE] Scanner UART2 siap.");

  // Setup MQTT Client
  mqttClient.setServer(mqtt_server.c_str(), mqtt_port);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(1024);        // Buffer JSON MQTT diperbesar

  // Aktifkan Task Watchdog Timer
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    esp_task_wdt_config_t twdt_config = {
        .timeout_ms = WDT_TIMEOUT_SECONDS * 1000,
        .idle_core_mask = 0,
        .trigger_panic = true
    };
    esp_task_wdt_reconfigure(&twdt_config);
  #else
    esp_task_wdt_init(WDT_TIMEOUT_SECONDS, true); 
  #endif
  
  esp_task_wdt_add(NULL); 

  // Setup Pin Relay sebagai Output
  pinMode(RELAY1_PIN, OUTPUT);
  pinMode(RELAY2_PIN, OUTPUT);
  digitalWrite(RELAY1_PIN, RELAY_DEACTIVE);
  digitalWrite(RELAY2_PIN, RELAY_DEACTIVE);

  // Setup Pin LED RFID sebagai Output
  pinMode(RFID_LED_PIN, OUTPUT);
  digitalWrite(RFID_LED_PIN, LOW); // Default mati (asumsi Active-HIGH)

  // Cek pembaruan firmware 1x saat booting
  cekUpdateGitHub();
}

void loop() {
  server.handleClient(); // Jaga agar server web tetap responsif

  // Tangani restart tertunda agar respon HTTP terkirim bersih ke browser
  if (pendingRestart && (millis() - restartTime > 2000)) {
    ESP.restart();
  }

  // Status Koneksi
  bool wifiConnected = (WiFi.status() == WL_CONNECTED);
  bool mqttConnected = mqttClient.connected();

  static unsigned long wifiDisconnectTime = millis();

  if (wifiConnected) {
    wifiDisconnectTime = millis();
  }

  // --- LOGIKA WATCHDOG TIMER (WDT) ---
  bool feedWDT = true;

  if (wm.getWiFiIsSaved()) {
    // Jika WiFi terputus > 60 detik (1 Menit)
    if (!wifiConnected && (millis() - wifiDisconnectTime > 60000)) {
      feedWDT = false;
    }
  }

