cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
  if (feedWDT) {
    esp_task_wdt_reset(); // Beri makan watchdog
  }

  // --- LOGIKA RECONNECT WIFI ---
  static unsigned long lastWifiCheck = 0;
  if (!wifiConnected) {
    // Coba reconnect setiap 10 detik
    if (millis() - lastWifiCheck > 10000) {
      lastWifiCheck = millis();
      if (wm.getWiFiIsSaved()) {
        Serial.println("[WIFI] Terputus! Mencoba menghubungkan ulang ke router...");
        WiFi.disconnect();
        WiFi.begin(); 
      }
    }
  }

  // --- LOGIKA RECONNECT MQTT ---
  if (wifiConnected) {
    if (!mqttConnected) {
      // Coba reconnect tiap 5 detik tanpa peduli WDT
      if (millis() - lastMqttReconnectAttempt > 5000) {
        lastMqttReconnectAttempt = millis();
        reconnectMQTT();
      }
    } else {
      mqttClient.loop();
    }
  }

  // Logika Pembacaan Barcode (UART2)
  if (Serial2.available()) {
    String barcodeData = Serial2.readStringUntil('\r');
    barcodeData.trim();
    if (barcodeData.length() > 0) {
      Serial.println("[BARCODE] Terdeteksi: " + barcodeData);
      lastBarcodeScan = barcodeData;
      
      if (wifiConnected && mqttClient.connected()) {
        String payload = "{\"barcode\":\"" + barcodeData + "\", \"rfid\":\"" + barcodeData + "\", \"device_id\":\"" + mqtt_client_id + "\"}";
        String pubTopic = "gate/" + mqtt_client_id + "/scan/in";
        if (mqttClient.publish(pubTopic.c_str(), payload.c_str())) {
          Serial.println("[MQTT] Barcode sukses terkirim.");
        } else {
          Serial.println("[MQTT] Barcode gagal terkirim!");
        }
      }
    }
  }

  // Tangani Re-inisialisasi RFID Non-Blocking akibat EMI Relay
  if (pendingRfidReinit && (millis() - pendingRfidReinitTime > 50)) {
    pendingRfidReinit = false;
    mfrc522.PCD_Init();
    mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);
  }

  // Logika Pembacaan & Health-Check Sensor RFID
  static unsigned long lastRFIDReadTime = 0;
  static unsigned long lastRfidHealthCheck = 0;
  static unsigned long lastPeriodicRfidReinit = 0;

  // Health-check berkala setiap 5 detik
  if (millis() - lastRfidHealthCheck > 5000) {
    lastRfidHealthCheck = millis();
    byte v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
    if (v == 0x00 || v == 0xFF) {
      Serial.println("[RFID] Sensor hang/terputus! Melakukan hard reset...");
      
      // Hardware Reset Pulsa via RST Pin
      digitalWrite(RST_PIN, LOW);
      pinMode(RST_PIN, OUTPUT);
      delay(20);
      digitalWrite(RST_PIN, HIGH);
      delay(50);
      
      // Reset SPI bus
      SPI.end();
      SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI, SS_PIN);
      
      mfrc522.PCD_Init();
      mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);
      delay(50);
      
      v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
      if (v != 0x00 && v != 0xFF) {
        rfidStatus = "✅ AKTIF (Dipulihkan)";
        Serial.printf("[RFID] Sensor pulih! Versi: 0x%02X\n", v);
      } else {
        rfidStatus = "❌ TIDAK MERESPON (Hang)";
        Serial.println("[RFID] Pemulihan gagal. Cek kabel.");
      }
    } else {
      if (rfidStatus.indexOf("✅") == -1) {
        rfidStatus = "✅ AKTIF";
      }
    }
  }

  // Soft-reset register berkala setiap 30 detik untuk memulihkan register yang ter-corrupt noise
  if (millis() - lastPeriodicRfidReinit > 30000) {
    lastPeriodicRfidReinit = millis();
    mfrc522.PCD_Init();
    mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);
  }

  // Proses scan kartu RFID
  if (mfrc522.PICC_IsNewCardPresent()) {
    if (mfrc522.PICC_ReadCardSerial()) {
      String rfidUid = "";
      for (byte i = 0; i < mfrc522.uid.size; i++) {
        rfidUid += String(mfrc522.uid.uidByte[i] < 0x10 ? "0" : "");
        rfidUid += String(mfrc522.uid.uidByte[i], HEX);
      }
      rfidUid.toUpperCase();

      unsigned long now = millis();
      
      // Cooldown logic cerdas
      bool isSameCard = (rfidUid == lastScannedUid);
      bool withinSameCardCooldown = (now - lastScannedTime < COOLDOWN_SAME_CARD_MS);
      bool withinAnyCardCooldown = (now - lastScannedTime < COOLDOWN_ANY_CARD_MS);

      if (isSameCard && withinSameCardCooldown) {
        // Abaikan agar tidak terjadi double-scan kartu yang sama
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
      } else if (withinAnyCardCooldown) {
        // Abaikan karena terlalu cepat dari scan sebelumnya
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
      } else {
        // Proses Validasi Kartu
        lastScannedUid  = rfidUid;
        lastScannedTime = now;
        lastRfidScan    = rfidUid;
        Serial.println("[RFID] Kartu Terdeteksi: " + rfidUid);

        // Nyalakan LED Indikator
        isRfidLedActive = true;
        rfidLedActiveTime = millis();
        digitalWrite(RFID_LED_PIN, HIGH);

        // Bypass jika master card
        if (rfidUid == rfid_master) {
          Serial.println("[MASTER] Master Card terdeteksi! Bypass buka gerbang.");
          triggerRelay(1);
        } else {
          // Kirim data scan ke MQTT Broker
          if (wifiConnected && mqttClient.connected()) {
            String payload = "{\"rfid\":\"" + rfidUid + "\", \"device_id\":\"" + mqtt_client_id + "\"}";
            String pubTopic = "gate/" + mqtt_client_id + "/scan/in";
            if (mqttClient.publish(pubTopic.c_str(), payload.c_str())) {
              Serial.println("[MQTT] Data scan terkirim ke EMQX.");
            } else {
              Serial.println("[MQTT] Gagal mengirim data scan!");
            }
          } else {
            Serial.println("[MQTT] Offline, data scan tidak dikirim.");
          }
        }

        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
      }
    } else {
      // Gagal membaca serial kartu (misalnya karena terganggu noise relay).
      // Bersihkan state kartu dan soft reset reader agar tidak stuck.
      mfrc522.PICC_HaltA();
      mfrc522.PCD_StopCrypto1();
      mfrc522.PCD_Init();
      mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);
    }
  }

  // Tangani timer matikan LED Indikator RFID otomatis
  if (isRfidLedActive && (millis() - rfidLedActiveTime > RFID_LED_ON_MS)) {
    isRfidLedActive = false;
    digitalWrite(RFID_LED_PIN, LOW);
  }

  // Tangani timer penutupan gerbang otomatis
  handleGate();
}